In [124]:
# 1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [125]:
import numpy as np
import pandas as pd

In [126]:
n1 = pd.Series([2, 4, 6, 8, 10])
print(n1)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [127]:
# 2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [128]:
def function1():
    l1 = [10,20,30,40,50]
    print(f"L1 = {l1} Type = {type(l1)}")
    
    n_arr = np.array([11,22,33,44])
    print(f"N_ARR = {n_arr} Type = {type(n_arr)}")
    
    s_series  = pd.Series([90,80,70,60,50])
    print(f"S_Series = {s_series} Type ={type(s_series)}")

In [129]:
function1()

L1 = [10, 20, 30, 40, 50] Type = <class 'list'>
N_ARR = [11 22 33 44] Type = <class 'numpy.ndarray'>
S_Series = 0    90
1    80
2    70
3    60
4    50
dtype: int64 Type =<class 'pandas.core.series.Series'>

In [130]:
# 3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
 #  Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [131]:
#l1 = [2, 4, 6, 8, 10]
#l2 = [1, 3, 5, 7, 9]
#n1 = l1 + l2
#print(n1)
#n2 = l1 - l2
#print(n1)
#n3 = l1 * l2
#print(n1)
#n3 = l1 / l2
#print(n1)

In [132]:
# 4. Write a Pandas program to convert a dictionary to a Pandas series.

In [133]:
s1 = {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':800}
print(s1)
pd_series = pd.Series(s1)
print(pd_series)

{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
a    100
b    200
c    300
d    400
e    800
dtype: int64

In [134]:
# 5. Write a Pandas program to convert a NumPy array to a Pandas series.

In [135]:
n1 = np.array([10, 20, 30, 40, 50])
print(n1)
pd_series = pd.Series(n1)
print(pd_series)

[10 20 30 40 50]
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [136]:
# 6. Write a Pandas program to change the data type of given a column or a Series.

In [137]:
def function1():
    students = pd.Series(["s1","s2","s3","s4"])
    print(students)

In [138]:
function1()

0    s1
1    s2
2    s3
3    s4
dtype: object

In [139]:
# 7. Write a Pandas program to convert a given Series to an array.

In [140]:
s1 = pd.Series(['100', '200', '300', '400','500'])
print(s1)
n1 = s1.values
print(n1)

0    100
1    200
2    300
3    400
4    500
dtype: object
['100' '200' '300' '400' '500']

In [141]:
# 8. Write a Pandas program to create a dataframe from a dictionary and display it.

In [142]:
def function1():
    p1 = ({"name":"P1","age":25,"id":1234})
    p2 = ({"name":"P2","age":35,"id":456})
    p3 = ({"name":"P3","age":20,"id":789})
    
    s1 = pd.Series(p1)
    s2 = pd.Series(p2)
    s3 = pd.Series(p3)
    
    df = pd.DataFrame([s1,s2,s3])

    print(s1)
    print(s2)
    print(s3)
    print(df)

In [143]:
function1()

name      P1
age       25
id      1234
dtype: object
name     P2
age      35
id      456
dtype: object
name     P3
age      20
id      789
dtype: object
  name  age    id
0   P1   25  1234
1   P2   35   456
2   P3   20   789

In [144]:
# 9. i) Create a list of empids and names (10 employees).
  # ii) Convert list into Series.
   #iii) Print type of Series.
   #iv) Convert Series into DataFrame.
   #v) a) Display all records.
    #  b) Display first five records.
     # c) Display last five records.
      #d) Display first two and last two records.
      #e) Display name of 5th employee.
      #f) Display record of 4th employee.
   #vi) Save the record in csv file (MyRecord.csv)

In [145]:
df = pd.read_csv('./50_Startups.csv')

In [146]:
#print(df)

In [147]:
print(df.columns)

Index(['RnD', 'Administration', 'Marketing', 'State', 'Profit'], dtype='object')

In [148]:
df.head(10)

         RnD  Administration  Marketing       State     Profit
0  165349.20       136897.80  471784.10    New York  192261.83
1  162597.70       151377.59  443898.53  California  191792.06
2  153441.51       101145.55  407934.54     Florida  191050.39
3  144372.41       118671.85  383199.62    New York  182901.99
4  142107.34        91391.77  366168.42     Florida  166187.94
5  131876.90        99814.71  362861.36    New York  156991.12
6  134615.46       147198.87  127716.82  California  156122.51
7  130298.13       145530.06  323876.68     Florida  155752.60
8  120542.52       148718.95  311613.29    New York  152211.77
9  123334.88       108679.17  304981.62  California  149759.96

In [149]:
df.head(2)

        RnD  Administration  Marketing       State     Profit
0  165349.2       136897.80  471784.10    New York  192261.83
1  162597.7       151377.59  443898.53  California  191792.06

In [150]:

df.tail(2)

       RnD  Administration  Marketing       State    Profit
48  542.05        51743.15       0.00    New York  35673.41
49    0.00       116983.80   45173.06  California  14681.40

In [ ]:
 #10. i) Read the MyRecord.csv file.
 #   ii) Create a new column Salary.